<a href="https://colab.research.google.com/github/nhwhite212/DealingwithDataSpring2021/blob/colab/1-SQL/D-MySQL_and_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Python MySQLdb module

To enable Python to access programatically the contents of MySQL, we need to install the package `python3-mysqldb`. To do so, type:

`sudo -H apt-get install -y python3-mysqldb`
If you happen to be in a Centos/Redhat environment, you will need yum to install something like
type:
`sudo yum install -y pymysql`

In [1]:
!apt-get install python3-dev libmysqlclient-dev
!apt-get install -y python3-mysqldb

Reading package lists... Done
Building dependency tree
Reading state information... Done
python3-dev is already the newest version (3.6.7-1~18.04).
The following NEW packages will be installed:
  libmysqlclient-dev
0 upgraded, 1 newly installed, 0 to remove and 13 not upgraded.
Need to get 988 kB of archives.
After this operation, 6,013 kB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu bionic-updates/main amd64 libmysqlclient-dev amd64 5.7.32-0ubuntu0.18.04.1 [988 kB]
Fetched 988 kB in 1s (798 kB/s)
Selecting previously unselected package libmysqlclient-dev.
(Reading database ... 146374 files and directories currently installed.)
Preparing to unpack .../libmysqlclient-dev_5.7.32-0ubuntu0.18.04.1_amd64.deb ...
Unpacking libmysqlclient-dev (5.7.32-0ubuntu0.18.04.1) ...
Setting up libmysqlclient-dev (5.7.32-0ubuntu0.18.04.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Reading package lists... Done
Building dependency tree
Reading state information... Done
Suggested packages:
  default-mysql-server | virtual-mysql-server python-egenix-mxdatetime
  python3-mysqldb-dbg
The following NEW packages will be installed:
  python3-mysqldb
0 upgraded, 1 newly installed, 0 to remove and 13 not upgraded.
Need to get 46.0 kB of archives.
After this operation, 183 kB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu bionic/main amd64 python3-mysqldb amd64 1.3.10-1build1 [46.0 kB]
Fetched 46.0 kB in 1s (65.7 kB/s)
Selecting previously unselected package python3-mysqldb.
(Reading database ... 146503 files and directories currently installed.)
Preparing to unpack .../python3-mysqldb_1.3.10-1build1_amd64.deb ...
Unpacking python3-mysqldb (1.3.10-1build1) ...
Setting up python3-mysqldb (1.3.10-1build1) ...

In [2]:
!pip3 install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/cc/ec/102bf59d0cdeb3b8fc82d6669bf96d57d133e44811ff57ad5e941bd8588d/mysql_connector_python-8.0.23-cp36-cp36m-manylinux1_x86_64.whl (18.0MB)
     |████████████████████████████████| 18.1MB 247kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (51.3.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.23

Now, let's try our first connection to the database:

In [3]:
import MySQLdb as mdb

# The connect() method has four parameters. 
# The first parameter is the host, where the MySQL database is located. 
# In our case it is a localhost, e.g. our computer. 
# The second parameter is the database user name. 
# It is followed by the user's account password. 
# The final parameter is the database name.
host = 'db.ipeirotis.org'
username = 'student'
password = 'dwdstudent2015'
database = 'imdb'

con = mdb.connect(host, username, password, database, 
                charset='utf8', use_unicode=True);
cur = con.cursor()
cur.execute("SELECT VERSION()")
ver = cur.fetchone()
print("Database version:", ver)
cur.close()
con.close()

Database version: ('5.7.30-google-log',)

And let's try our first query. You will use the `fetchall` command, which returns all the results as a tuple of tuples.

In [4]:
import MySQLdb  as mdb

con = mdb.connect(host, username, password, database, charset='utf8', use_unicode=True);

cur = con.cursor()
cur.execute("SELECT * FROM actors LIMIT 100")
results = cur.fetchall()
cur.close()
con.close()

print(results)

((2, 'Michael', "'babeepower' Viera", 'M'), (3, 'Eloy', "'Chincheta'", 'M'), (4, 'Dieguito', "'El Cigala'", 'M'), (5, 'Antonio', "'El de Chipiona'", 'M'), (6, 'José', "'El Francés'", 'M'), (7, 'Félix', "'El Gato'", 'M'), (8, 'Marcial', "'El Jalisco'", 'M'), (9, 'José', "'El Morito'", 'M'), (10, 'Francisco', "'El Niño de la Manola'", 'M'), (11, 'Víctor', "'El Payaso'", 'M'), (12, 'Antonio', "'El Pescaíto'", 'M'), (13, 'Luis', "'El Plojo'", 'M'), (14, 'Janny', "'el Portugues'", 'M'), (15, 'Antonio', "'El Rilete'", 'M'), (16, 'Baltazar', "'El Toro'", 'M'), (17, 'Luis Roberto', "'Formiga'", 'M'), (18, 'Murray the', "'K'", 'M'), (19, 'Néstor', "'Kick Boxer'", 'M'), (20, 'Tony', "'La Chispa'", 'M'), (21, 'Pollino', "'Romero'", 'M'), (22, 'Frans', "'t Hoen", 'M'), (23, 'Jorrit', "'t Hoen", 'M'), (24, 'Dick', "'t Hooft", 'M'), (25, 'Jacob', "'The Jeweler'", 'M'), (26, 'Izzy', "'The Religious Nut'", 'M'), (27, "Ka'olelo", "'Ulaleo", 'M'), (28, 'Oswald', "'Ô'", 'M'), (29, 'Todd', '1', 'M'), (30, 'Mac', '10', 'M'), (32, 'Angel', '11:11', 'M'), (33, 'Nick', '13', 'M'), (34, 'Shaggy', '2 Dope', 'M'), (35, 'Mode', '2', 'M'), (36, 'Benjamin', '2X', 'M'), (37, 'The', '3 Whippets', 'M'), (38, 'André', '3000', 'M'), (40, 'Articolo', '31', 'M'), (41, "Rappin'", '4-Tay', 'M'), (42, 'The', '4D Jones', 'M'), (43, 'Mick', '5', 'M'), (44, 'James', '52X', 'M'), (45, 'Lucky', '7', 'M'), (46, 'Marc', '7', 'M'), (47, 'Equipe', '84', 'M'), (48, 'Ahmed', 'A El Rahim', 'M'), (49, 'Dragan', 'a zovu ga Elvis', 'M'), (50, 'Brett', "A'Hearn", 'M'), (51, 'Lejaren', "a'Hiller", 'M'), (52, 'Yussuf Abed', "A'Nur", 'M'), (53, 'Headhunter', 'A', 'M'), (55, 'Yunga', 'A', 'M'), (56, 'Cairns', 'A.', 'M'), (57, 'Dominique', 'A.', 'M'), (58, 'Narayana Rao', 'A.', 'M'), (59, 'Prasad', 'A.', 'M'), (60, 'Satyanarayana', 'A.', 'M'), (61, 'Narayana', 'A.L.', 'M'), (62, 'Raja', 'A.M.', 'M'), (63, 'Krishna', 'A.R.', 'M'), (64, 'Alwi', 'A.S.', 'M'), (65, 'Giri', 'A.S.', 'M'), (66, 'Subba Rao', 'A.V. Jr.', 'M'), (67, 'Subba Rao', 'A.V.', 'M'), (68, 'Brynjar', 'Aa', 'M'), (69, 'Andreas', 'Aabel', 'M'), (70, 'Hauk (I)', 'Aabel', 'M'), (71, 'Per (I)', 'Aabel', 'M'), (72, 'Palle', 'Aabentoft', 'M'), (73, 'Dennis', 'Aaberg', 'M'), (74, 'Linus (I)', 'Aaberg', 'M'), (75, 'Linus (II)', 'Aaberg', 'M'), (76, 'Kristian', 'Aaby', 'M'), (77, 'Olaf', 'Aabye', 'M'), (78, 'Tørres', 'Aadland', 'M'), (79, 'Argo', 'Aadli', 'M'), (80, 'Per', 'Aaeng', 'M'), (81, 'Karl', 'Aagaard Østvig Jr.', 'M'), (82, 'Carl Powl', 'Aagaard', 'M'), (83, 'Egon', 'Aagaard', 'M'), (84, 'Jesper', 'Aagaard', 'M'), (85, 'Lasse', 'Aagaard', 'M'), (86, 'Sebastian', 'Aagaard-Williams', 'M'), (87, 'Karl', 'Aagard Østvig', 'M'), (88, 'Per', 'Aage Brandt', 'M'), (89, 'Jan', 'Aagre', 'M'), (90, 'Thomas', 'Aagren', 'M'), (91, 'Dee', 'Aaker', 'M'), (92, 'Lee', 'Aaker', 'M'), (93, 'Kim Fupz', 'Aakeson', 'M'), (94, 'Steve', 'Aalam', 'M'), (95, 'Freddy', 'Aalbeck', 'M'), (96, 'George', 'Aalbregise', 'M'), (97, 'Niels', 'Aalbæk Jensen', 'M'), (98, 'Karsten', 'Aalholm', 'M'), (99, 'Preben', 'Aalholt', 'M'), (100, 'Henri', 'Aalto', 'M'), (101, 'Keijo', 'Aalto', 'M'), (102, 'Petri', 'Aalto', 'M'), (103, 'Rostislav', 'Aalto', 'M'), (106, 'Pauli', 'Aalto-Setälä', 'M'))

Now, let's fetch the data line by line, to avoid having long execution times when fetching the results

In [5]:
import MySQLdb as mdb

con = mdb.connect(host, username, password, database, charset='utf8', use_unicode=True);

# Returning all data at a time may not be feasible. We can fetch rows one by one.
cur = con.cursor()
cur.execute("SELECT * FROM actors LIMIT 10")
# We fetch the rows one by one using the fetchone() method. 
# The rowcount property gives the number of rows returned by the SQL statement.
for i in range(cur.rowcount):
    row = cur.fetchone()
    print(row)
    print(row[0], row[1], row[2])
cur.close()
con.close()

(2, 'Michael', "'babeepower' Viera", 'M')
2 Michael 'babeepower' Viera
(3, 'Eloy', "'Chincheta'", 'M')
3 Eloy 'Chincheta'
(4, 'Dieguito', "'El Cigala'", 'M')
4 Dieguito 'El Cigala'
(5, 'Antonio', "'El de Chipiona'", 'M')
5 Antonio 'El de Chipiona'
(6, 'José', "'El Francés'", 'M')
6 José 'El Francés'
(7, 'Félix', "'El Gato'", 'M')
7 Félix 'El Gato'
(8, 'Marcial', "'El Jalisco'", 'M')
8 Marcial 'El Jalisco'
(9, 'José', "'El Morito'", 'M')
9 José 'El Morito'
(10, 'Francisco', "'El Niño de la Manola'", 'M')
10 Francisco 'El Niño de la Manola'
(11, 'Víctor', "'El Payaso'", 'M')
11 Víctor 'El Payaso'

**The dictionary cursor:** There are multiple cursor types in the MySQLdb module. The default cursor returns the data in a tuple of tuples. When we use a dictionary cursor (`mdb.cursors.DictCursor`), the data is placed in a Python dictionary, which allows us to refer to the data by their column names. This will be very handy later, when we use Pandas to create dataframes.

In [6]:
import MySQLdb as mdb

# The dictionary cursor
# There are multiple cursor types in the MySQLdb module. 
# The default cursor returns the data in a tuple of tuples. 
# When we use a dictionary cursor, the data is sent in a form of Python dictionaries. 
# This way we can refer to the data by their column names.

con = mdb.connect(host, username, password, database, charset='utf8', use_unicode=True);
    
sql_query = "SELECT * FROM actors LIMIT 10"

cur = con.cursor(mdb.cursors.DictCursor)
cur.execute(sql_query)
rows = cur.fetchall()
for row in rows:
    print(row)
    print(row["id"], row["first_name"], row["last_name"])
    
cur.close()
con.close()

{'id': 2, 'first_name': 'Michael', 'last_name': "'babeepower' Viera", 'gender': 'M'}
2 Michael 'babeepower' Viera
{'id': 3, 'first_name': 'Eloy', 'last_name': "'Chincheta'", 'gender': 'M'}
3 Eloy 'Chincheta'
{'id': 4, 'first_name': 'Dieguito', 'last_name': "'El Cigala'", 'gender': 'M'}
4 Dieguito 'El Cigala'
{'id': 5, 'first_name': 'Antonio', 'last_name': "'El de Chipiona'", 'gender': 'M'}
5 Antonio 'El de Chipiona'
{'id': 6, 'first_name': 'José', 'last_name': "'El Francés'", 'gender': 'M'}
6 José 'El Francés'
{'id': 7, 'first_name': 'Félix', 'last_name': "'El Gato'", 'gender': 'M'}
7 Félix 'El Gato'
{'id': 8, 'first_name': 'Marcial', 'last_name': "'El Jalisco'", 'gender': 'M'}
8 Marcial 'El Jalisco'
{'id': 9, 'first_name': 'José', 'last_name': "'El Morito'", 'gender': 'M'}
9 José 'El Morito'
{'id': 10, 'first_name': 'Francisco', 'last_name': "'El Niño de la Manola'", 'gender': 'M'}
10 Francisco 'El Niño de la Manola'
{'id': 11, 'first_name': 'Víctor', 'last_name': "'El Payaso'", 'gender': 'M'}
11 Víctor 'El Payaso'

### We can also issue SQL statements directly from our notebooks by using sql_magic
##### First we have to load in the sql magic support
##### Magic support allows us to issue single or multiple sql commands from a cell

In [7]:
%load_ext sql

#### create a connection to the google database server

In [8]:
%%sql mysql://student:dwdstudent2015@db.ipeirotis.org/imdb
select * from actors 
where first_name like 'M%'
limit 20

20 rows affected.

[(52268, "M'Amar", 'Boumedine', 'M'),
 (21857, "M'barek", 'Aït el Caïd', 'M'),
 (137141, "M'Barek", 'El Hammoudi', 'M'),
 (188481, "M'Barick", 'Guisse', 'M'),
 (234965, "M'Barka", 'Jrad', 'M'),
 (605934, "M'el", 'Dowd', 'F'),
 (43073, "M'Hamed", 'Binakdane', 'M'),
 (622102, "M'Liss", 'Fonte', 'F'),
 (715686, "M'liss", 'McClure', 'F'),
 (307307, "M'Lissa", 'Mayo', 'M'),
 (709094, "M'mah", 'Maribe', 'F'),
 (41416, "M'Rad", 'Bey', 'M'),
 (253027, 'M-H', 'Kohlberg', 'M'),
 (421314, 'M-Pierre', 'Sauvanet', 'M'),
 (282, 'M.', 'Abaishvili', 'M'),
 (678, 'M.', 'Abdulayev', 'M'),
 (682, 'M.', 'Abdulkhabirov', 'M'),
 (1300, 'M.', 'Abramyan', 'M'),
 (2081, 'M.', 'Adamczewski', 'M'),
 (3203, 'M.', 'Afanasyev', 'M')]

### Lets switch to our class server at Stern, bigdata.stern.nyu.edu
#### Each Team has their own userid and database in the mysql server on bigdata

In [9]:
import MySQLdb as mdb

# The connect() method has four parameters. 
# The first parameter is the host, where the MySQL database is located. 
# In our case it is a localhost, e.g. our computer. 
# The second parameter is the database user name. 
# It is followed by the user's account password. 
# The final parameter is the database name.
host = 'bigdata.stern.nyu.edu'
username = 'DealingS21'
password = 'DealingS21!!'
database = 'DealingS21'

con = mdb.connect(host, username, password, database, 
                charset='utf8', use_unicode=True);
cur = con.cursor()
cur.execute("SELECT VERSION()")
ver = cur.fetchone()
print("Database version:", ver)
cur.close()
con.close()

Database version: ('5.6.48',)

### We now have access to both databases and can issue sql statements